Revit 2027 API
Space.FloorReflectance Property
Get or set the Floor Reflectance of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FloorReflectance { get; set; }
Public Property FloorReflectance As Double
	Get
	Set
public:
property double FloorReflectance {
	double get ();
	void set (double value);
}
member FloorReflectance : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Floor Reflectance of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace